/*
【题目描述】
在国际象棋棋盘上放置八个皇后，要求每两个皇后之间不能直接吃掉对方。

【输入】
(无)

【输出】
按给定顺序和格式输出所有八皇后问题的解（见样例）。

【输入样例】
（无）
【输出样例】
No. 1
1 0 0 0 0 0 0 0 
0 0 0 0 0 0 1 0 
0 0 0 0 1 0 0 0 
0 0 0 0 0 0 0 1 
0 1 0 0 0 0 0 0 
0 0 0 1 0 0 0 0 
0 0 0 0 0 1 0 0 
0 0 1 0 0 0 0 0 
No. 2
1 0 0 0 0 0 0 0 
0 0 0 0 0 0 1 0 
0 0 0 1 0 0 0 0 
0 0 0 0 0 1 0 0 
0 0 0 0 0 0 0 1 
0 1 0 0 0 0 0 0 
0 0 0 0 1 0 0 0 
0 0 1 0 0 0 0 0 
...以下省略
*/
#include <iostream>
using namespace std;

int a[100] = {0}, d[100]={0}, b[100]={0}, c[100]={0}, num = 1;

int solve(int i)
{
	if (i > 8)
	{
		cout << "No. " << num++ << endl;
		for (int m = 1; m <= 8; m++)
		{
			for (int n = 1; n <= 8; n++)
			{
				if (m == a[n])
					cout << 1;
				else
					cout << 0;
				if (n != 8)
					cout << " ";
			}
			cout << endl;
		}
		return 0; 
	}
	
	for (int j = 1; j <= 8; j++)
	{
		if (!b[j] && !c[i+j] && !d[i-j+7])
		{
			a[i] = j;
			b[j] = 1;		// 列 |
			c[i+j] = 1;		// 斜线 / 
			d[i-j+7] = 1; 	// 斜线 \ 
			
			solve(i+1);
			
			b[j] = 0;	
			c[i+j] = 0;
			d[i-j+7] = 0;
		}
	}
	return 0;
}

int main()
{
	solve(1);
	return 0;
}
