/*
【题目描述】
任何一个大于1的自然数n，总可以拆分成若干个小于n的自然数之和。

当n=7共14种拆分方法：

7=1+1+1+1+1+1+1
7=1+1+1+1+1+2
7=1+1+1+1+3
7=1+1+1+2+2
7=1+1+1+4
7=1+1+2+3
7=1+1+5
7=1+2+2+2
7=1+2+4
7=1+3+3
7=1+6
7=2+2+3
7=2+5
7=3+4
total=14
【输入】
输入n。

【输出】
按字典序输出具体的方案。

【输入样例】
7
【输出样例】
7=1+1+1+1+1+1+1
7=1+1+1+1+1+2
7=1+1+1+1+3
7=1+1+1+2+2
7=1+1+1+4
7=1+1+2+3
7=1+1+5
7=1+2+2+2
7=1+2+4
7=1+3+3
7=1+6
7=2+2+3
7=2+5
7=3+4
*/
#include <iostream>
using namespace std;

int n, a[100001] = {0};

int search(int x, int s)
{
	if (s == n)
	{
		cout << n << "=";
		for (int i = 1; i < x; i++)
		{
			cout << a[i];
			if (i != x-1)
				cout << "+";
		}
		cout << endl;
		return 0;
	}
	else if (s > n)
		return 0;
	
	for (int i = 1; i < n; i++)
	{
		if (a[x-1] > i)
			continue;
		a[x] = i;
		search(x+1, s+a[x]);
	}
	return 0;
}

int main()
{
	while (cin >> n)
	{
		search(1, 0);
	}
	return 0;
}
